; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
InitialFileName := A_AutoSignal A_Now
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
RandomFileName := "STALCRAFT-DATA,,,,,,,,,,,,," . A_Now
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
; Ãåíåðèðóåì ñëó÷àéíîå ÷èñëî äëÿ íîâîãî èìåíè ôàéëà
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
Result := "Finish"
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
loopActive = false ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
F5::
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  InitialFileName := A_AutoSignal
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  FileMove, %A_ScriptFullPath%, %A_ScriptDir%\%InitialFileName%.ahk
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  MsgBox, %Result%
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  ExitApp
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
F4::
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  loopActive = true
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  SetTimer, AutoSignal, On ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  ; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
return
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
F3::
  ; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  loopActive = false ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  SetTimer, AutoSignal, Off
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
return
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
AutoSignal:
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
  if (loopActive) ; 
  { 
    RandomFileName := "STALCRAFT-DATA,,,,,,,,,,,,," . A_Now
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    FileMove, %A_ScriptFullPath%, %A_ScriptDir%\%RandomFileName%.ahk
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    Send, {x}
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    Sleep, 100
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    MouseMove, nX, nY
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    Click
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    CoordMode, Mouse, Screen
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    x = 689
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    y = 406
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    nX = 1087
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    nY = 810
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    PixelGetColor, targetColor, %x%, %y%
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    Sleep, 100
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    PixelGetColor, currentColor, %x%, %y%
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    if (currentColor != targetColor)
    {
      PixelGetColor, S, %x%, %y%
      PixelGetColor, F, %x%, %y%
      ; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      newX = 1354
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      newY = 793
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      X = 635
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Y = 580
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      MouseMove, newX, newY
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Click
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Sleep, 10500
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Click
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      MouseMove, X, Y
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Click
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      if (S != F)
      {
      SetTimer, AutoSignal, Off ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      SetTimer, AutoSignal, On ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      }
      loopActive = false ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      SetTimer, AutoSignal, Off ; 
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    }
    else
    {
      Sleep, 100
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
      Send, {x}
      ; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
    }
  }

return
; Ñîõðàíÿåì íà÷àëüíîå èìÿ ôàéëà
